import { ReviewType } from '../const/type';

export const mockReviews: ReviewType[] = [
  {
    'id': 'a0a22b2b-67e7-4d89-a696-6e3fb8cea5c7',
    'userName': 'Анастасия',
    'advantage': 'Недорогая, за такую цену отличный вариант.',
    'disadvantage': 'Пришла поврежденная упаковка. Нет теперь понимая со внутренностями',
    'review': 'Отличная камера, мне понравилась, пользуюсь около года. Профессионально оценить нет возможности.',
    'rating': 5,
    'createAt': '2025-09-18T11:52:19.393Z',
    'cameraId': 1
  },
  {
    'id': '2fa729cc-8977-4e46-abd3-c326474a7480',
    'userName': 'Кирилл',
    'advantage': 'Недорогая, за такую цену отличный вариант.',
    'disadvantage': 'Странные звуки при переключении режимов',
    'review': 'Отличная камера. Великолепные снимки, проста в управлении. Полностью оправдывает стоимость',
    'rating': 2,
    'createAt': '2025-10-24T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'e960d4cc-b2f9-463c-8bff-46293bf81e88',
    'userName': 'Кирилл',
    'advantage': 'Нет.',
    'disadvantage': 'Пришла поврежденная упаковка. Нет теперь понимая со внутренностями',
    'review': 'Отличная камера, мне понравилась, пользуюсь около года. Профессионально оценить нет возможности. Есть разные мелкие недочеты, но, по скольку я не являюсь специалисто в данной области, они не ощущаются в моих работах.',
    'rating': 1,
    'createAt': '2025-04-24T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'fad4aca7-7dd4-4917-b763-01ac15b4e357',
    'userName': 'Анастасия',
    'advantage': 'Хорошо. Отличная камера.',
    'disadvantage': 'Трудно найти чехол. Заводские крайне дррогие',
    'review': 'Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания',
    'rating': 4,
    'createAt': '2025-04-22T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'af3a07e6-e3c5-461a-bdec-ee04ae587a8f',
    'userName': 'Никита',
    'advantage': 'Смущает цена',
    'disadvantage': 'Странные звуки при переключении режимов',
    'review': 'Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания',
    'rating': 5,
    'createAt': '2025-08-14T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': '3a07a996-5ac5-4cd6-b0c8-faa2509804d9',
    'userName': 'Павел',
    'advantage': 'Покупали недавно. Пока нареканий нет.',
    'disadvantage': 'Странные звуки при переключении режимов',
    'review': 'Не возможно найти дополнительные аккамуляторы. К сожалению, те, что идут в комплекте не держут более 7 часов?',
    'rating': 4,
    'createAt': '2025-04-16T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': '928ea5e6-3fca-4ea5-b0c5-e7040b6bf1b8',
    'userName': 'Александр',
    'advantage': 'Хороший стабилизатор и матрица',
    'disadvantage': 'Быстро садиться зарядка',
    'review': 'Приобрела камеру ориентируясь на отзывы, но выявила множество несоответствий. Цена не оправдала ожидания',
    'rating': 3,
    'createAt': '2025-04-16T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'e0996e93-f4ed-4f66-bc7c-5fcd799a16ee',
    'userName': 'Ксения',
    'advantage': 'Рекомендую данный аппарат',
    'disadvantage': 'Быстро садиться зарядка',
    'review': 'В целом для домашнего использования в самый раз!',
    'rating': 4,
    'createAt': '2025-05-23T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'c313dd68-385b-4c70-8e2d-5480d9e1f07e',
    'userName': 'Дарья',
    'advantage': 'Настройки, внешний вид, лёгкость',
    'disadvantage': 'Пришла поврежденная упаковка. Нет теперь понимая со внутренностями',
    'review': 'Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать',
    'rating': 4,
    'createAt': '2025-08-27T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'd47276dc-6201-49ee-a7b4-a1d29cf32871',
    'userName': 'Ольга',
    'advantage': 'Смущает цена',
    'disadvantage': 'Нет.',
    'review': 'Это моя первая камера. Я в восторге, нареканий нет',
    'rating': 2,
    'createAt': '2025-05-26T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': '5b2609ca-f65d-4432-b60b-3c7a703ca8ca',
    'userName': 'Дарья',
    'advantage': 'Хороший стабилизатор и матрица',
    'disadvantage': 'Пришла поврежденная упаковка. Нет теперь понимая со внутренностями',
    'review': 'Камера для начинающих, самое то. Но урезанный комплект и многое придётся докупать',
    'rating': 2,
    'createAt': '2025-04-24T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': '81378d2e-5d29-4a73-bbbf-bae17cd174a4',
    'userName': 'Павел',
    'advantage': 'Нет.',
    'disadvantage': 'Не рекомендую!',
    'review': 'Камера достаточно хорошая, но не очень радует цена.',
    'rating': 4,
    'createAt': '2025-10-24T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'ed73db55-62b9-41a0-9b3d-4184976094aa',
    'userName': 'Дарья',
    'advantage': 'Недорогая, за такую цену отличный вариант.',
    'disadvantage': 'Нет.',
    'review': 'Подарила сыну на первое сентября прошлого года. Пришла целой. Для начала камера хорошая.',
    'rating': 1,
    'createAt': '2025-10-19T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': 'a3fa188e-978d-4f2b-8136-b69ac146402f',
    'userName': 'Ольга',
    'advantage': 'Легкая в плане веса, удобная в интерфейсе, зарядка',
    'disadvantage': 'Без объектива',
    'review': 'Хорошая камера. Лучше за эти деньги не найти.',
    'rating': 1,
    'createAt': '2025-06-20T11:52:19.394Z',
    'cameraId': 1
  },
  {
    'id': '287746c5-1fa8-4e17-b31f-db36e587490e',
    'cameraId': 1,
    'userName': 'Кирилл',
    'advantage': 'Легкая в плане веса, удобная в интерфейсе',
    'disadvantage': 'Быстро садиться зарядка',
    'review': 'Это моя первая камера. Я в восторге, нареканий нет',
    'rating': 5,
    'createAt': '2025-11-14T03:31:25.165Z'
  }
];
